tap 'homebrew/cask-versions'

# brew 'ack' # Search tool like grep, but optimized for programmers
brew 'ag' # Code-search similar to ack
brew 'aspell' # Spell checker with better logic than ispell
brew 'autoconf' # Automatic configure script builder
brew 'automake' # Tool for generating GNU Standards-compliant Makefiles
brew 'bat' # Clone of cat(1) with syntax highlighting and Git integration
# brew 'cairo' # Vector graphics library with cross-device output support
# brew 'carthage' # Decentralized dependency manager for Cocoa
brew 'cmake' # Cross-platform make
# brew 'cocoapods' # Dependency manager for Cocoa projects
brew 'colordiff' # Color-highlighted diff(1) output
brew 'colormake' # Wrapper around make to colorize the output
brew 'colortail' # Like tail(1), but with various colors for specified output
brew 'dnsmasq' # Lightweight DNS forwarder and DHCP server - supports wildcards
brew 'docker' # Pack, ship and run any application as a lightweight container
brew 'docker-compose' # Isolated development environments using Docker
brew 'fasd' # CLI tool for quick access to files and directories
brew 'fdupes' # Identify or delete duplicate files
brew 'ffmpeg' # Play, record, convert, and stream audio and video
brew 'fontconfig' # XML-based font configuration API for X Windows
brew 'fontforge' # Command-line outline and bitmap font editor/converter
brew 'fortune' # Infamous electronic fortune-cookie generator
brew 'freetype' # Software library to render fonts
brew 'gdbm' # GNU database manager
brew 'gettext' # GNU internationalization (i18n) and localization (l10n) library
# brew 'gifsicle' # GIF image/animation creator/editor; Monosnap chosen instead of this
brew 'git' # Distributed revision control system
brew 'git-lfs' # Git extension for versioning large files
brew 'glib' # Core application library for C
# brew 'global' # Source code tag system [emacs related]
brew 'gmp' # GNU multiple precision arithmetic library
brew 'gnupg' # GNU Pretty Good Privacy (PGP) package
brew 'gobject-introspection' # Generate introspection data for GObject libraries
brew 'graphviz' # Graph visualization software from AT&T and Bell Labs
brew 'grc' # Colorize logfiles and command output
brew 'grep' # GNU grep, egrep and fgrep
brew 'harfbuzz' # OpenType text shaping engine
brew 'htop' # Improved top (interactive process viewer)
brew 'icu4c' # C/C++ and Java libraries for Unicode and globalization
brew 'iftop' # Display an interface's bandwidth usage
brew 'imagemagick' # Tools and libraries to manipulate images in many formats
brew 'jansson' # C library for encoding, decoding, and manipulating JSON
brew 'jenv' # Manage your Java environment
brew 'jemalloc' # Implementation of malloc emphasizing fragmentation avoidance
brew 'jpeg' # Image manipulation library
# brew 'kubernetes-cli' # Kubernetes command-line interface
# brew 'launchdns' # Mini DNS server designed solely to route queries to localhost VS dnsmasq ??
brew 'libevent' # Asynchronous event library
brew 'libffi' # Portable Foreign Function Interface library
brew 'libgcrypt' # Cryptographic library based on the code from GnuPG
brew 'libgda' # Provides unified data access to the GNOME project
brew 'libgpg-error' # Common error values for all GnuPG components
brew 'libksba' # X.509 and CMS library
brew 'libpng' # Library for manipulating PNG images
brew 'libsodium' # NaCl networking and cryptography library
brew 'libtiff' # TIFF library and utilities
brew 'libtool' # Generic library support script
brew 'libyaml' # YAML Parser
brew 'llvm' # Next-gen compiler infrastructure
brew 'mas' # Mac App Store command-line interface
brew 'md5sha1sum' # Hash utilities
brew 'memcached' # High performance, distributed memory object caching system
brew 'nodenv' # Manage multiple NodeJS versions
brew 'node-build' # Install NodeJS versions (NOTE: this isn't a dep of nodenv?)
brew 'nginx' # HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew 'openssl' # Cryptography and SSL/TLS Toolkit
brew 'p7zip' # 7-Zip (high compression file archiver) implementation
brew 'pandoc' # Swiss-army knife of markup format conversion TODO: Look into this tool more
brew 'pango' # Framework for layout and rendering of i18n text
brew 'pcre' # Perl compatible regular expressions library
brew 'pixman' # Low-level library for pixel manipulation
brew 'pkg-config' # Manage compile and link flags for libraries
brew 'postgresql' # Object-relational database system
brew 'pyenv' # Python version management
brew 'rbenv' # Ruby version manager
brew 'rbenv-default-gems' # Auto-installs gems for Ruby installs
brew 'readline' # Library for command-line editing
brew 'redis' # Persistent key-value database, with built-in net interface
brew 'ruby-build' # Explicitly dependency of rbenv (installs different versions of ruby)
brew 'sox' # SOund eXchange: universal sound sample translator
brew 'sqlite' # Command-line interface for SQLite
brew 'telnet' # User interface to the TELNET protocol
brew 'terminal-notifier' # Send macOS User Notifications from the command-line
brew 'tree' # Display directories as trees (with optional color/HTML output)
brew 'unrar' # Extract, view, and test RAR archives
brew 'watch' # Executes a program periodically, showing output fullscreen- brew links to https://gitlab.com/procps-ng/procps
brew 'watchman' # Watch files and take action when they change
brew 'wget' # Internet file retriever
brew 'wrk' # HTTP benchmarking tool TODO: Look into this tool more
brew 'xz' # General-purpose data compression with high compression ratio
brew 'youtube-dl' # Download YouTube videos from the command-line
brew 'zlib' # General-purpose lossless data-compression library
brew 'zsh' # UNIX shell (command interpreter)

cask 'airflow' # Watch local content on Apple TV and Chromecast. VS beamer?
# cask 'arduino'
cask 'arq' # Backup computer to the cloud
# cask 'astropad' # turn your iPad into a professional drawing tablet
cask 'atext' # aText accelerates your typing in any app by replacing abbreviations w/ freq used phrases you define. vs textexpander ?
# cask 'atom' # Best text editor ever, much better than vim, emac, and especially space-macs # Install manually
# cask 'audiobookbinder' # Convert all your mp3 books to iPod-compatible m4b format
# cask 'audioscrobbler' # Minimal, robust iTunes scrobbling (for Last.fm)
# cask 'barrier' # Open-source KVM software
cask 'bartender'
# 1 cask 'base' # Create, design, edit and browse SQLite 3 db files
cask 'beamer' # Stream directly from your Mac to Apple TV and Chromecast
cask 'brave-browser'
# cask 'caffeine' # Prevent your Mac from automatically going to sleep, dimming the screen or starting screen savers; Amphetamine chosen instead
cask 'carbon-copy-cloner' # Bootable backup solution for the Mac
cask 'cheatsheet' # Hold the ⌘-Key a bit longer to get a list of all active short cuts of the current application
cask 'choosy' # Open every link in the right browser
cask 'chromedriver'
cask 'dash'
cask 'docker'
cask 'discord'
cask 'disk-arbitrator' # Forensic utility which manages file system mounting in support of forensic procedures
cask 'duet' # Use a phone/tablet device as a second screen: Duet Pro still has features Sidecar does not (now in Catalina)
cask 'dropbox'
cask 'expressvpn' # Secure Mac VPN client
cask 'fantastical' # Multi-device streamlined calendar app; it's FantastiCaL!
cask 'firefox'
cask 'firefox-developer-edition'
cask 'flux' # A better Night Shift: kill blue light in your display gracefully at night
cask 'fsmonitor' # Monitor all changes in the file system
cask 'ghosttile' # Hide your running applications from Dock
cask 'github'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'grandperspective' # Graphically show disk usage
cask 'hammerspoon' # New Slate but with even more features and functions
cask 'hyper' # Electron-based terminal (built on HTML/CSS/JS)
cask 'id3-editor' # Small and simple MP3 and AIFF ID3 tag editor
cask 'insomnia' # Design and debug APIs like a human, not a robot
# cask 'intel-power-gadget' # Software-based power usage monitoring tool for Intel® Core™ processors
cask 'istat-menus' # This one looks like it's also in the app store, which is the better place to install it?
cask 'iterm2' # Is it Hyper OR iTerm2? What do you think?
cask 'itsycal' # Tiny menu bar calendar. -Is this better than the iStats one?
# cask 'java' # We will install with jenv instead, and only install system java if required later on
cask 'karabiner-elements' # A powerful and stable keyboard customizer -- Instead of Hammerspoon?
cask 'knox' # 1Password's file valut program
# cask 'launchbar' # quick launch programs
# cask 'lingo' # The visual home for your brand; Create and share living style guides, asset libraries and more
cask 'mojibar' # A menubar app adaptation of Emoji searcher.
cask 'ngrok' # One command for an instant, secure URL to your localhost server through any NAT or firewall
cask 'noun-project' # Icons for everything
# cask 'nvalt' # Store and retrieve notes: Notational Velocity; https://nvultra.com/ is in private beta and will be out soon; Bear was chosen instead
cask 'phantomjs'
cask 'quitter' # Automatically hide or quit apps after periods of inactivity
cask 'resilio-sync' # New name for bit torrent sync
cask 'safari-technology-preview'
# cask 'semulov' # Eject volumes from the menu bar
cask 'sequel-pro' # DB management app for working with MySQL databases
cask 'sketch' # Sketch 2 is already out, will this one work?
cask 'skype'
cask 'slack'
cask 'slate' # Is this instead of hammerspoon?
cask 'sonic-pi' # Sonic Pi is a code-based music creation and performance tool.
cask 'spotify'
# cask 'qobuz'
# cask 'textexpander' # Easily insert text snippets in any application from a library of content created by you and your team; atext chosen instead
cask 'tor-browser'
cask 'transmission'
cask 'tripmode' # save mobile data when on the go: stop background backups, updates, photos syncs, etc.
cask 'vlc'
cask 'vmware-fusion'
cask 'webtorrent' # Streaming torrent app Web Torrent Desktop
cask 'zeplin'
cask 'zoomus'

# Specific taps
#
# tap 'thoughtbot/formulae'
# brew 'rcm' # RC file (dotfile) management: https://thoughtbot.github.io/rcm/rcm.7.html
# consider using only if taking a very similar approach to mkcode dotfiles

# tap 'd12frosted/emacs-plus'
# brew 'emacs-plus'

tap 'heroku/brew'
brew 'heroku'

tap 'mongodb/brew'
brew 'mongodb-community-compass'

# OpenJDK 8 for use with android-studio
# tap 'AdoptopenJDK/openjdk'
# cask 'adoptopenjdk8'

# Homebrew Fonts
tap 'homebrew/cask-fonts'
cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'
cask 'font-fantasque-sans-mono'

# Mac App Store
#
# `mas list`
#

# mas 'Agenda', id: 1287445660 # Note taking program
mas '1Password 7', id: 1333542190
# mas 'Affinity Designer', id: 824171161 # Alternate program to Illustrator
# mas 'Affinity Photo', id: 824183456 # Alternate program to Photoshop
# mas 'Amphetamine', id: 937984704 # is this better than Caffine? Or perhaps Caffine isn't support in Mojave and above?
mas 'Bear', id: 1091189122 # Private Markdown Notes
mas 'Browser Ninja', id: 995838410 # Painlessly switch your default browser
mas 'Clocks', id: 414554506 # World Clocks Menubar app
mas 'Evernote', id: 406056744
mas 'GarageBand', id: 682658836
# mas 'HazeOver', id: 430798174 # Focus and reduce visual noise by dimming background windows/apps
mas 'iMovie', id: 408981434
# mas 'iStat Menus', id: 1319778037 # installed as a cask instead
mas 'Keynote', id: 409183694
mas 'Kindle', id: 405399194
# mas 'Mail Notifr', id: 808154494 # Simple mail notifier for Gmail
mas 'Markdown Pro', id: 465965038
mas 'Monosnap', id: 540348655
mas 'Numbers', id: 409203825
mas 'OmniFocus', id: 867299399
mas 'Orangered Notifier', id: 468366517 # Put reddit alerts in your menu bar
# mas 'Padlock', id: 415667090 # `mas info 415667090` results in "No results found - Error: No results found"
mas 'Pages', id: 409201541
# mas 'Pixelmator', id: 407963104 # Full-featured image editor allows edits to photoshop files
mas 'SiteSucker', id: 442168834
mas 'Speedtest', id: 1153157709 # Simple Speedtest by Ookla
# mas 'SQLPro Studio', id: 985614903 # Part of Setapp
mas 'The Unarchiver', id: 425424353
mas 'Transmit', id: 403388562
mas 'Wallpaperer', id: 1102248738
# mas 'Xcode', id: 497799835 # Install manually because it's such a large file
mas 'Yoink', id: 457622435 # Improved drag & drop with clipboard functionality
